Revit 2024 API
NumberingSchemaTypes.StructuralNumberingSchemas Class
 A collection of types of built-in Numbering Schemas that are used for numbering structure elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class StructuralNumberingSchemas
Visual Basic
Public NotInheritable Class StructuralNumberingSchemas
Visual C++
public ref class StructuralNumberingSchemas abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas
See Also
NumberingSchemaTypes.StructuralNumberingSchemas Members
Autodesk.Revit.DB Namespace